import 'package:flutter/material.dart';
import 'package:flutter/services.dart';

class NepaliQuotes extends StatefulWidget {
  const NepaliQuotes({Key? key}) : super(key: key);

  @override
  State<NepaliQuotes> createState() => _NepaliQuotesState();
}

class _NepaliQuotesState extends State<NepaliQuotes> {
  final key = new GlobalKey<ScaffoldState>();
  List<String> nepaliquotes = [
    "हिन्दुहरुको महान चाड बिजया दशमीको अबसरमा बिशेष गरी देशभरिका युबा- युबतिहरुमा शान्ति, सदभाब र ब्यक्तिगत, पारिवारिक र सामाजिक सम्बृद्विको लागि लाग्ने ऊर्जा प्राप्त होस भन्दै नबदुर्गा मातासॅग प्राथना गर्दछु!.",
    "जयन्ती मङ्गला काली भद्रकाली कपालिनी । दुर्गा शिवा क्षमा धात्री स्वाहा स्वधा नमोस्तुते ।। नेपालीहरुको महान चाड बडा दशैं 2079 को मंगलमय शुभकामना तपाईलाई । सदा खुशी रहनु होस्, सुखी रहनु होस्!",
    "सबै नेपालीहरुको घरघरमा आएको चाड दशैंको अवसरमा सबै बन्धुबान्धव अनि इष्टमित्रमा हार्दिक शुभकामना !",
    "नेपालीहरूको महान चाड 2079 सालको विजया दशामी तथा शुभा दिपावालीको हदिॅक मङ्रगलमय सुःखा र शान्तीको कमाना व्याक्त गदॅछु।",
    "पिङमा मच्चिएस,दारुको घ्याम्पो रित्याएस तासमा माल परोस,मासुमा हड्डी नपरोस् दशैमा घर जादा सबैको यात्रा शुभ होस छेउमा च्वाँक परेस,सुड्डी नपरेस!",
    "याे दसै तिहार यो चाड पर्व बच्चा बेलैमा रमाइलो नया लुगा, नया जुत्ता कति हो कति लगाईयाे!",
    "सात समुन्द्र पारि बाट भए पनि आउदै गरेको महान चाड बढ़ा दशैं तथा दिपवली को हार्दिक मंगलमय सुभ कामना ! बिजय दशमी को सुभकामना ",
    "के दसै के तिहार प्रदेसमा हुनेलाई, जीवन लाक्छ बेकार प्रदेसमा हुनेलाई, चाड – बाड आउदा घर जान नपाउदा खेरी, चोट पर्छ लगातार प्रदेसमा हुनेलाई, के दसै के तिहार प्रदेसमा हुनेलाई …",
    "हिन्दुको महान चाड बिजयादशमिको पावन अबसरमा सुस्वास्थ्य: दिर्घायु:र सम्ब्र्द्दिको कामना ।",
    "आफ्नो पियरा पियरा बाबा आमा अनि तो सुन्दर घर अनि दाजु भाइ दिदी बहिनी अनि जीवन सङिनिअनी ती मुटु का धद्कन छोरा छोरी लाई चतकै छोडेर बिदेस पस्ने कस्को रहर हुन्छ र साथ मा आमाले पकाए को मिठो भोजन इ ठुला ठुला चाड पर्व हरु मा कुन पर्देसी छोरा लाई आमा को याद न आउला र तर पर्देसी जिन्दगी ………….?",
    "जे छ आफु सङ्ग त्यसैमा रमाउ खुलेर यो चाड खुसीले मनाउ :: बिजय दशमी को सुभकामना ",
    "आउनुहोस्, यो सुन्दर उत्सवमा सँगसँगै रमाऔं । दशैं जस्ता उत्सवहरू हामी फेरि फेरि बारम्बार सँगसँगै मनाउन पाउँ, देवी दुर्गासँग यही कामना गरौं । दशैंको शुभकामना मेरो प्रिय परिवार ।",
    "तपाईंको खुशी र सुखी जीवनको लागि धेरै मान्छेहरुले शुभकामना दिनेछन् । तर मेरो शुभेच्छा केहि विशेष छ । म यो महान विजयादशमी पर्व तपाईंहरुसँग हुन चाहन्छु र परिवारसँग मनाउन चाहन्छु । शुभ दशैं मेरो परिवार ।",
    "म तपाईंलाई खुशी, कल्याण, समृद्धि र सफलताको शुभेच्छा देवी दुर्गासँग प्रार्थना स्वरुप राख्न चाहन्छु । उनले महेशासुरलाई पराजित गरेकी थिइन्, तपाईले समाजको सबै खराब तत्वहरुलाई नष्ट गर्न सक्नुहोस् भन्ने कामना गर्न चाहन्छु।",
    "तपाईं समृद्धि, आनन्द, कल्याण, सुखद जीवन पाउन सक्नुहोस् । म तपाईलाई एक खुशी र समृद्ध विजयादशमीको शुभकामना दिन चाहन्छु।",
    "तपाईंको जीवनको हरेक सेकेन्ड आनन्दित जीवन होस् । हरेक यस्ता उत्सवहरुले तपाईंलाई खुशी दिओस् । विजयादशमी तपाईलाई बधाई छ।",
    "मेरो परिवारले सधैं मेरो र्समर्थन गरेको छ । हाम्रो जीवनको खुशीयाली क्षणको लागि हाम्रो सम्बन्ध अझ प्रगाढ बनाउनको लागि यो दशैं पर्व मनाऔं । विजयादशमीको शुभ अवसरमा मंगलमय शुभकामना ।",
    "धैर्यता र आशाका साथ तपाईका आगामी दिनहरू उज्यालोमय बनाउन देवी दुर्गाका आशिषहरू तपाईको साथमा सँधै रहोस् । म तपाईको खुशीको लागि शुभकामना व्यक्त गर्दछु ।",
    "उत्साह, उमाङ ,उत्सव, खुसी ,शान्ति, उल्लास ,हर्स, सुख ,प्रसन्नता, सुबिस्ता ,आनन्द, सम्रिधी,उन्नती, कल्याण, मंगल्, सुबिधा,अभुदय ,यी शब्दहरु शब्दकोस मा मात्र नरहुन येही छ बिजया दशमी को शुभकामना",
    "टीका र जमराको यो दशैं पर्व खुशी र समृद्धिको केन्द्र भएको छ । दसैंको पवित्र उत्सव सुरु भएको छ । मौसम आनन्द र प्रेमले भरिएको छ । आशा छ कि सुन्दरताको यो चाड प्रगतिको बाटो देखाउनेछ, सन्तुष्टि को उज्ज्वल चमकले जीवन उजिल्याउने छ । दशैंको शुभकामना !!",
    "भगवानले  विजया दशमी को शुभ अवसरमा आशीर्वाद दिनुहोस् र यो चाडले तपाइँको जीवन मा सबै खराबीलाई हराउन सक्षम बनाउन सकोस।",
    "पानि खाेज्दा बियर भेटियाेस् धारा खाेल्दा दारू बगाेस् चिकन खादा, साप्राे पराेस मटन खादा, ह्याकुला पराेेस् यहिनै छ मेराे विजया दशमिकाे शुभकामना  !!!",
    "भाग्य चम्कोस सबै को सबै को होस् सुख समृद्धि सुख शान्ति को बास होस् चारै तिर माता दुर्गा को आशिर्बाद रहिरहोस सर्बदा विजया दशमी २०७९ को यहि छ शुभकामना।",
    "टीका होस निधारमाजमरा होस कानमासुख होस परिवारमाशान्ति होस देशमापुरा होस मनकामनायही छ मेरो विजयादशमी २०८० को हार्दिक मंगलमय शुभकामना।",
    "बिहानी उज्यालो लाई पर्खन्दै अन्धेरी रातमा रुमलिये पनि, झरणालाई नियालेर नि तिर्खाईमा तड्पिए पनि, सहसको बाटो परिवर्तण नहोस् यात्रा निरन्तार चलिरहोस हुरिबतासको लहर जति नै बेगले चले पनि, कर्मको दियो आटुट बलिरहोसयहि छ मेरो भावना, विजया दशमीको हार्दिक मङ्गलमय शुभकामना! शुभकामना!! शुभकामना!!!",
    "आयो दशै ढोल बजाइगयो दशै रिन बोकाइउखान को पुनराबित्ति नहोस्,झाडापखाला पीडित को पेट मा अन्न परोसखोक्रो आडम्बर त्यागेर दशै मनाउबिजया दशमी को येही कामना",
    "झाडा पखाला पिडितकाे पेटमा अन्न पराेस् दुखि हरूकाे अनुहार मा खुशी छाओस् दुर्गा माताकाे आशिर्वादले सबै सामु खुशिकाे रमझम छाओस ह्याप्पि दशै २०८०!!!",
    "चाङ्गा चैट रमाइलाे भेटखसिकाे रेट मासुकाे प्लेटजुवाकाे खाल , चिउराकाे थाल ८० साल दसै बवालह्याप्पि दशैं !!!",
    "दशैं तब सुन्दर हुन्छ जब परिवार र साथीहरुसँग खुशीका पलहरु सेयर गर्नको लागी एक ठाउँमा जमघट हुन्छ । हाँसो, खाना, चंगा, टीका, आर्शिवाद, पिङको साथमा रमाईलो दशैंको शुभकामना । तपाई र तपाईको परिवारलाई विजयादशमीको मंगलमय शुभकामना दिन्छु, खुशीयाली छावोस जीवनमा ।",
    "प्रिय, म तपाईलाई दशैंमा एक राम्रो शुभकामना दिन चाहान्छु । मलाई आशा छ कि तपाईले सबैलाई टीका र जमरासँगै शुभआशिष दिनुहुन्छ । तपाईको घरमा खुशी छावोस् ।"
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Color.fromRGBO(255, 69, 0, 1),
        title: Text(
          "NEPALI DASHAIN STATUS",
          style: TextStyle(
              color: Colors.white,
              fontWeight: FontWeight.bold,
              fontSize: 20,
              fontFamily: 'Trajan Pro'),
        ),
      ),
      backgroundColor: Color.fromRGBO(211, 211, 211, 5),
      body: Padding(
        padding: const EdgeInsets.all(5.0),
        child: ListView.builder(
            itemCount: 30,
            itemBuilder: (BuildContext context, int index) {
              return Padding(
                padding: const EdgeInsets.fromLTRB(5, 5, 5, 0),
                child: Card(
                  color: Colors.white,
                  child: ListTile(
                    onTap: () {
                      Clipboard.setData(
                          ClipboardData(text: nepaliquotes[index]));
                      ScaffoldMessenger.of(context).showSnackBar(
                        SnackBar(
                          content: Text(
                            "Text Copied!!",
                            style: TextStyle(
                                fontSize: 20,
                                color: Colors.white,
                                fontWeight: FontWeight.bold),
                          ),
                          backgroundColor: Color.fromRGBO(255, 69, 0, 1),
                        ),
                      );
                    },
                    title: Padding(
                      padding: const EdgeInsets.fromLTRB(0, 5, 5, 0),
                      child: Text(
                        nepaliquotes[index],
                        textAlign: TextAlign.justify,
                        style: TextStyle(
                          fontSize: 14,
                          height: 1.3,
                          fontFamily: 'poppins',
                          color: Color.fromRGBO(255, 69, 0, 1),
                        ),
                      ),
                    ),
                  ),
                ),
              );
            }),
      ),
    );
  }
}
